posts/2010-12-14-if-you-could-have-only-one-thing-for-christmas.org
#+date: <2010-12-14>
#+filetags: humor
#+title: If you could have only one thing for Christmas

If you could have only one thing for Christmas

In today's [[http://wapo.st/dHHR2P][Washington Post]], Petula Dvorak's column includes a story about a 6-year-old who was told by her mother to scale back her Christmas list. So, she wrote a letter to "Dear Sata" asking for just one thing, a remote control that controlled the world.

When her mother pointed out that the salutation was missing an "N", she simply added it to the end of the name. So, it read, "Dear Satan,..." Fitting, somehow.


