docs/posts/2010-12-14-if-you-could-have-only-one-thing-for-christmas.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 18, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>If you could have only one thing for Christmas</title>
<meta name="author" content="Randall Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">If you could have only one thing for Christmas</h1>
<p class="subtitle" role="doc-subtitle">Dec 14, 2010</p>
</header><p>
If you could have only one thing for Christmas
</p>

<p>
In today&rsquo;s <a href="http://wapo.st/dHHR2P">Washington Post</a>, Petula Dvorak&rsquo;s column includes a story about a 6-year-old who was told by her mother to scale back her Christmas list. So, she wrote a letter to &ldquo;Dear Sata&rdquo; asking for just one thing, a remote control that controlled the world.
</p>

<p>
When her mother pointed out that the salutation was missing an &ldquo;N&rdquo;, she simply added it to the end of the name. So, it read, &ldquo;Dear Satan,&#x2026;&rdquo; Fitting, somehow.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 18, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15).
</div>
</footer>
</body>
</html>
